/* ********************************************************************* 
       _____        _               _    ___ ____   ____
      |_   _|___  _| |_ _   _  __ _| |  |_ _|  _ \ / ___|
       | |/ _ \ \/ / __| | | |/ _` | |   | || |_) | |
       | |  __/>  <| |_| |_| | (_| | |   | ||  _ <| |___
       |_|\___/_/\_\\__|\__,_|\__,_|_|  |___|_| \_\\____|

 Copyright (c) 2010 — 2013 Codeux Software & respective contributors.
        Please see Contributors.pdf and Acknowledgements.pdf

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:

    * Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
    * Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in the
      documentation and/or other materials provided with the distribution.
    * Neither the name of the Textual IRC Client & Codeux Software nor the
      names of its contributors may be used to endorse or promote products
      derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 SUCH DAMAGE.

 *********************************************************************** */

"BlowfishNoEncryptionKeySet" = "Ingen krypteringsnøkkel er satt.";
"BlowfishCurrentEncryptionKey" = "Nåværende Krypteringsnøkkel: %@";

"BlowfishEncryptionStartedInPrivateMessage" = "Kryptering startet i privatmelding. Hvis vinduet blir stengt må du sette passordet på nytt.";

"BlowfishKeyExchangeSuccessful_1" = "Suksessful nøkkelutveksling. Meldinger sent til \002%@\002 vil nå være kryptert.";
"BlowfishKeyExchangeSuccessful_2" = "\002Advarsel:\002 Hvis dette vinduet blir stengt, vil du måtte utveksle nøkkler på nytt for å fortsette kryptert chatting.";
"BlowfishKeyExchangeForQueriesOnly" = "Du kan bare bruke nøkkelutveksling i privatmeldinger.";
"BlowfishKeyExchangeRequestAlreadyExists" = "En nøkkelutveksling er allerede i gang med \002%@\002. Vennligst vent for den nåværende til å gå ut før du starter en ny.";
"BlowfishKeyExchangeRequestReceived" = "Motatt nøkkelutvekslings forespørsel fra \002%@\002. Behandler ...";
"BlowfishKeyExchangeRequestSent" = "Nøkkelutvekslings forespørsel har blitt sent til \002%@\002.";
"BlowfishKeyExchangeRequestTimedOut" = "Nøkkelutvekslings forespørsel til \002%@\002 har gått ut.";
"BlowfishKeyExchangeResponseSent" = "Nøkkelutvekslings svar har blitt sent til \002%@\002. ";
"BlowfishKeyExchangeResponseReceived" = "Motatt nøkkelutvekslings svar fra \002%@\002. Behandler ...";

"BlowfishKeyExchangeCannotHandleEncryptedRequest_1" = "Kan ikke behandle nøkkelutvekslings forespørsel fra \002%@\002 før den aktive krypteringen er slått av.";
"BlowfishKeyExchangeCannotHandleEncryptedRequest_2" = "Kan ikke behandle nøkkelutvekslings forespørsel for \002%@\002 før den aktive krypteringen er slått av.";

"BlowfishKeyExchangeErrorOccurred_1" = "Nøkkel utveksling feilet: Kunne inn generere offentlig nøkkel.";
"BlowfishKeyExchangeErrorOccurred_2" = "Nøkkel utveksling feilet: Kunne ikke komputere hemmlig nøkkel fra offentlig nøkkel.";
